app/controllers/topics_controller.rb

  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My Ruby Topic"], ["description", "This is sparkling and very red."], ["created_at", "2018-06-09 17:06:50.199174"], ["updated_at", "2018-06-09 17:06:50.199174"]]

  def update
    respond_to do |format|
      if @topic.update(topic_params)
---
UPDATE "topics" SET "description" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["description", "This is sparkling and quite red."], ["updated_at", "2018-06-09 17:07:29.198517"], ["id", 1]]